--
--
--
--
--
drop table dict_dim;
create table dict_dim (
    book_num            varchar(32)   not null,
    dim                 char(30)      not null,
    name                varchar(64)   not null,
    remark              varchar(128),
    
    ts_c                timestamp  default current timestamp
) in tbs_dat index in tbs_idx;

--
-- 核算项字典表
--
comment on table  dict_dim               is '核算项字典表';
comment on column dict_dim.book_num 	 is '科目编号';
comment on column dict_dim.dim 	         is '核算项';
comment on column dict_dim.name          is '核算项中文名';
comment on column dict_dim.remark        is '核算项描述';

-- data
insert into dict_dim(book_num, dim, name, remark) values
       ('2005.02', 'zyzj_acct', '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('2005.02', 'zjbd_type', '资金变动类型',           '资金变动类型'),
       ('2005.02', 'zjbd_date', '银行出入账日期',         '银行出入账日期'),
       ('2005.02', 'period',    '会计期间',               '会计期间'),

       ('1020.03', 'zjbd_type', '资金变动类型',           '资金变动类型'),
       ('1020.03', 'zyzj_acct', '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('1020.03', 'zjbd_date', '银行出入账日期',         '银行出入账日期'),
       ('1020.03', 'period',    '会计期间',               '会计期间'),

       ('2005.03', 'bfj_acct',  '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('2005.03', 'zjbd_type', '资金变动类型',           '资金变动类型'),
       ('2005.03', 'zjbd_date', '银行出入账日期',         '银行出入账日期'),
       ('2005.03', 'period',    '会计期间',               '会计期间'),

       ('1020.04', 'bfj_acct',  '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('1020.04', 'zjbd_type', '资金变动类型',           '资金变动类型'),
       ('1020.04', 'zjbd_date', '银行出入账日期',         '银行出入账日期'),
       ('1020.04', 'period',    '会计期间',               '会计期间'),

       ('2010.01', 'c',         '客户编号',               '客户编号'),
       ('2010.01', 'period',    '会计期间',               '会计期间'),

       ('2202.01.001', 'bfj_acct',  '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('2202.01.001', 'bi',        '银行接口编号',           '银行接口编号'),
       ('2202.01.001', 'e_date',    '差错日期',               '差错日期'),
       ('2202.01.001', 'period',    '会计期间',               '会计期间'),

       ('2202.01.002', 'zyzj_acct', '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('2202.01.002', 'e_date',    '差错日期',               '差错日期'),
       ('2202.01.002', 'period',    '会计期间',               '会计期间'),

       ('1122.02.001', 'bfj_acct',  '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('1122.02.001', 'bi',        '银行接口编号',           '银行接口编号'),
       ('1122.02.001', 'e_date',    '差错日期',               '差错日期'),
       ('1122.02.001', 'period',    '会计期间',               '会计期间'),

       ('1122.02.002', 'zyzj_acct', '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('1122.02.002', 'e_date',    '差错日期',               '差错日期'),
       ('1122.02.002', 'period',    '会计期间',               '会计期间'),

       ('1122.01.001', 'c',         '客户编号',               '客户编号'),
       ('1122.01.001', 'p',         '产品类型',               '产品类型'),
       ('1122.01.001', 'tx_date',   '交易日期',               '交易日期'),
       ('1122.01.001', 'period',    '会计期间',               '会计期间'),

       ('6421.01', 'c',         '客户编号',               '客户编号'),
       ('6421.01', 'p',         '产品类型',               '产品类型'),
       ('6421.01', 'bi',        '银行接口编号',           '银行接口编号'),
       ('6421.01', 'period',    '会计期间',               '会计期间'),

       ('6421.02', 'c',         '客户编号',               '客户编号'),
       ('6421.02', 'p',         '产品类型',               '产品类型'),
       ('6421.02', 'period',    '会计期间',               '会计期间'),

       ('1002.01', 'bfj_acct',  '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('1002.01', 'period',    '会计期间',               '会计期间'),

       ('1002.02', 'zyzj_acct', '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('1002.02', 'period',    '会计期间',               '会计期间'),

       ('6603.02', 'zyzj_acct', '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('6603.02', 'period',    '会计期间',               '会计期间'),

       ('6021.01', 'c',         '客户编号',               '客户编号'),
       ('6021.01', 'p',         '产品类型',               '产品类型'),
       ('6021.01', 'period',    '会计期间',               '会计期间'),

       ('6603.01', 'zyzj_acct', '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('6603.01', 'period',    '会计期间',               '会计期间'),

       ('1020.01', 'bfj_acct',  '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('1020.01', 'bi',        '银行接口编号',           '银行接口编号'),
       ('1020.01', 'tx_date',   '交易日期',               '交易日期'),
       ('1020.01', 'period',    '会计期间',               '会计期间'),

       ('2241.01', 'c',         '客户编号',               '客户编号'),
       ('2241.01', 'tx_date',   '交易日期',               '交易日期'),
       ('2241.01', 'period',    '会计期间',               '会计期间'),

       ('2005.01', 'bfj_acct',  '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('2005.01', 'zjbd_type', '资金变动类型',           '资金变动类型'),
       ('2005.01', 'zjbd_date', '银行出入账日期',         '银行出入账日期'),
       ('2005.01', 'period',    '会计期间',               '会计期间'),

       ('1020.02', 'bfj_acct',  '银行账户号及相应开户行', '银行账户号及相应开户行'),
       ('1020.02', 'zjbd_type', '资金变动类型',           '资金变动类型'),
       ('1020.02', 'zjbd_date', '银行出入账日期',         '银行出入账日期'),
       ('1020.02', 'period',    '会计期间',               '会计期间'),

       ('3001.03', 'period',    '会计期间',               '会计期间'),

       ('3001.04', 'wlzj_type', '往来类型',               '往来类型'),
       ('3001.04', 'period',    '会计期间',               '会计期间'),

       ('3001.01', 'wlzj_type', '往来类型',               '往来类型'),
       ('3001.01', 'period',    '会计期间',               '会计期间'),

       ('3001.02', 'period',    '会计期间',               '会计期间');


