--
--
--
--
--
drop table dict_book;
create table dict_book (
    id           integer      not null primary key,
    code         varchar(32)  not null,
    value        char(32)     not null,
    name         varchar(128) not null,
    class        integer      not null,
    set          integer      not null,
    jd           integer      not null,
    memo         varchar(1024), 
    ts_c         timestamp  default current timestamp
) in tbs_dat index in tbs_idx;

--
-- 末级科目信息
--
comment on table  dict_book          is '末级科目信息';
comment on column dict_book.id       is '科目内部代码';
comment on column dict_book.code     is '科目编号';
comment on column dict_book.value    is '科目';
comment on column dict_book.name     is '科目名称';
comment on column dict_book.class    is '科目类型';
comment on column dict_book.set      is '所属账套';
comment on column dict_book.jd       is '方向';
comment on column dict_book.memo     is '科目说明';

-- book
-- insert into dict_book( id, code, value, name, class, set, jd, memo) values
-- (1,  '2005.02',     'bamt_yhyf',     '应付银行-已核应付银行款',          '2', '0', '2', '资金划拨成功数据、自有资金账户管理费' ),
insert into dict_book(id, code, value, name, class, set, jd, memo) values
( 1, '2005.02', 'bamt_yhyf', '应付银行-已核应付银行款', 2, 0, 2, '资金划拨成功数据、自有资金账户管理费' ),
( 2, '1020.03', 'bamt_yhys', '应收银行-已核应收银行款', 1, 0, 1, '资金划拨成功数据、自有资金利息收入数据' ),
( 3, '2005.03', 'bfee_yhyf', '应付银行-已核应付银行手续费', 2, 1, 2, '交易发生时的情况下，银行手续费' ),
( 4, '1020.04', 'bfee_yhys', '应收银行-已核应收银行手续费', 1, 1, 1, '撤销、退款的情况下，银行手续费退还' ),
( 5, '2010.01', 'bfj_cust', '客户备付金-备付金', 2, 1, 2, '交易成功后商户委托收款，贷方记录商户委托收款的金额增加，借方表示商户委托收款金额减少' ),
( 6, '2202.01.001', 'blc', '应付账款-银行-备份金银行长款', 2, 1, 2, '贷方表示备付金应收银行款多收，借方表示多收款项已退回' ),
( 7, '2202.01.002', 'blc_zyzj', '应付账款-银行-自有资金银行长款', 2, 0, 2, '贷方表示自有资金账户应收银行款多收，借方表示多收款项已退回' ),
( 8, '2202.01.003', 'bfee_cwwf', '应付账款-银行-财务外付银行手续费', 2, 0, 2, '应付账款-银行-财务外付银行手续费' ),
( 9, '1122.02.001', 'bsc', '应收账款-银行-备付金银行短款', 1, 1, 1, '借方表示备付金账户应收银行款少收，贷方表示少收款项已追回转出' ),
( 10, '1122.02.002', 'bsc_zyzj', '应收账款-银行-自有资金银行短款', 1, 0, 1, '借方表示自有资金账户应收银行款少收，贷方表示少收款项已追回转出' ),
( 11, '1122.01.001', 'cfee_dqhf', '应收账款-客户-定期划付客户手续费', 1, 0, 1, '外扣客户手续费时，挂账科目' ),
( 12, '6421.01', 'cost_bfee', '成本-银行手续费支出', 5, 0, 1, '确认的银行手续费支出成本' ),
( 13, '6421.02', 'cost_dfss', '成本-垫付损失', 5, 0, 1, '收款交易，流水勾兑我有银无的情况下，无法追回时造成的损失' ),
( 14, '1002.01', 'deposit_bfj', '银行存款-备付金存款', 1, 1, 1, '备付金存款专用账户' ),
( 15, '1002.02', 'deposit_zyzj', '银行存款-自有资金存款', 1, 0, 1, '自有资金存款专用账户' ),
( 16, '6603.02', 'fee_jrjg', '财务费用-金融机构手续费', 5, 0, 1, '备付金，自有资金账户管理费、资金调拨的银行手续费' ),
( 17, '6021.01', 'income_cfee', '收入-客户手续费收入', 5, 0, 2, '因为交易产生的客户手续费收入' ),
( 18, '6603.01', 'income_zhlx', '财务费用-账户利息收入', 5, 0, 1, '备付金，自有资金账户利息收入' ),
( 19, '1020.01', 'txamt_dgd', '应收银行-待勾兑应收交易款', 1, 1, 1, '内部交易流水与银行流水比对差异挂账' ),
( 20, '2241.01', 'txamt_dqr', '其他应付款-待确认交易款', 2, 1, 2, '收款时内部交易流水与银行流水比对差异挂账' ),
( 21, '2005.01', 'txamt_yhyf', '应付银行-已核应付交易款', 2, 1, 2, '内部交易流水与银行流水比对成功数据、资金划拨成功数据、备付金账户管理费' ),
( 22, '1020.02', 'txamt_yhys', '应收银行-已核应收交易款', 1, 1, 1, '内部交易流水与银行流水比对成功数据、资金划拨成功数据、备付金利息收入数据' ),
( 23, '3001.03', 'wlzj_yfbf', '往来-应付备付', 4, 0, 2, '备付金替自有资金付款，例如内扣银行手续费，备付金账户管理费' ),
( 24, '3001.04', 'wlzj_yfzy', '往来-应付自有', 4, 1, 2, '备付金替自有资金收款，例如内扣客户手续费收入，备付金账户利息收入' ),
( 25, '3001.01', 'wlzj_ysbf', '往来-应收备付', 4, 0, 1, '备付金替自有资金收款，例如内扣客户手续费收入，备付金账户利息收入' ),
( 26, '3001.02', 'wlzj_yszy', '往来-应收自有', 4, 1, 1, '备付金替自有资金付款，例如内扣银行手续费，备付金账户管理费' );
