--
-- 原始凭证描述表
--
drop table dict_yspz;
create table dict_yspz (
    code      char(4)      not null primary key,
    name      varchar(128) not null,
    memo      varchar(512) not null,
    ts_c      timestamp    default current timestamp
) in tbs_dat index in tbs_idx;


--
-- 原始凭证类型信息
--
comment on table  dict_yspz           is '原始凭证类型信息';
comment on column dict_yspz.code      is '凭证编号';
comment on column dict_yspz.memo      is '凭证描述';


insert into dict_yspz(code, name, memo) values
('0000', '特种调账单', '特种调账单'),
('0001', '基金行业线-备付金内扣成本补充', '基金行业线-备付金内扣成本补充'),
('0002', '基金线-委托收款勾兑成功', '基金线-委托收款勾兑成功'),
('0003', '基金线-委托收款勾兑不成功（我有银无）', '基金线-委托收款勾兑不成功（我有银无）'),
('0004', '基金线-委托收款勾兑不成功（银有我无）', '基金线-委托收款勾兑不成功（银有我无）'),
('0005', '基金线-委托收款勾兑不成功（我有银无，追回，处理完成）', '基金线-委托收款勾兑不成功（我有银无，追回，处理完成）'),
('0006', '基金线-委托收款勾兑不成功（银有我无，补付客户备付金）', '基金线-委托收款勾兑不成功（银有我无，补付客户备付金）'),
('0007', '基金线-委托收款结算', '基金线-委托收款结算'),
('0008', '基金线-赎回款汇入成功', '基金线-赎回款汇入成功'),
('0009', '基金线-赎回款汇出成功', '基金线-赎回款汇出成功'),
('0010', '基金线资金对账成功', '基金线资金对账成功'),
('0011', '基金线资金对账银行多付（银行长款）', '基金线资金对账银行多付（银行长款）'),
('0012', '基金线资金对账银行少付（银行短款）', '基金线资金对账银行少付（银行短款）'),
('0013', '基金线-账户管理费', '基金线-账户管理费'),
('0014', '基金线-账户利息收入', '基金线-账户利息收入'),
('0015', '基金线-备付金账户间资金划拨', '基金线-备付金账户间资金划拨'),
('0016', '直联POS代清算收款勾兑成功', '直联POS代清算收款勾兑成功'),
('0017', '直联POS代清算收款反向交易勾兑成功', '直联POS代清算收款反向交易勾兑成功'),
('0018', '客户备付金汇入', '客户备付金汇入'),
('0019', '出款勾兑成功', '出款勾兑成功'),
('0020', '出款勾兑不成功（我有银无）', '出款勾兑不成功（我有银无）'),
('0021', '出款勾兑不成功（银有我无）', '出款勾兑不成功（银有我无）'),
('0022', '出款勾兑不成功（我有银无，银行继续出款）', '出款勾兑不成功（我有银无，银行继续出款）'),
('0023', '出款勾兑不成功（我有银无，撤单）', '出款勾兑不成功（我有银无，撤单）'),
('0024', '出款勾兑不成功（银有我无，客户补单）', '出款勾兑不成功（银有我无，客户补单）'),
('0025', '出款勾兑不成功（银有我无，追回）', '出款勾兑不成功（银有我无，追回）'),
('0026', '出款勾兑不成功（银有我无，确认损失）', '出款勾兑不成功（银有我无，确认损失）'),
('0027', '出款退回', '出款退回'),
('0028', '成功出款请求', '成功出款请求'),
('0029', '勾兑成功出款', '勾兑成功出款'),
('0030', '出款退回', '出款退回'),
('0032', 'POS收款勾兑成功', 'POS收款勾兑成功'),
('0033', 'POS收款勾兑不成功(我有银无)', 'POS收款勾兑不成功(我有银无)'),
('0034', 'POS收款勾兑成(我有银无，银行追回)', 'POS收款勾兑成(我有银无，银行追回)'),
('0035', 'POS收款勾兑成功(我有银无，撤单)', 'POS收款勾兑成功(我有银无，撤单)'),
('0036', 'POS收款勾兑成功(我有银无,确认损失)', 'POS收款勾兑成功(我有银无,确认损失)'),
('0037', 'POS收款原接口反向交易勾兑成功', 'POS收款原接口反向交易勾兑成功'),
('0038', 'POS收款原接口反向交易勾兑不成功(我有银无)', 'POS收款原接口反向交易勾兑不成功(我有银无)'),
('0039', 'POS收款原接口反向交易勾兑不成功(我有银无，继续出款)', 'POS收款原接口反向交易勾兑不成功(我有银无，继续出款)'),
('0040', 'POS收款原接口反向交易勾兑(我有银无，撤单)', 'POS收款原接口反向交易勾兑(我有银无，撤单)'),
('0041', 'POS委托打款', 'POS委托打款'),
('0042', 'POS打款失败', 'POS打款失败'),
('0043', 'POS收款线下传真反向交易', 'POS收款线下传真反向交易'),
('0044', 'POS收款分账', 'POS收款分账'),
('0045', 'POS收款勾兑不成功', 'POS收款勾兑不成功'),
('0046', 'POS收款勾兑不成功（银有我无，客户补单）', 'POS收款勾兑不成功（银有我无，客户补单）'),
('0047', 'POS收款勾兑不成功（银有我无，退回银行）', 'POS收款勾兑不成功（银有我无，退回银行）'),
('0048', 'POS收款原接口反向交易勾兑（银有我无）', 'POS收款原接口反向交易勾兑（银有我无）'),
('0049', 'POS收款原接口反向交易勾兑（银有我无，客户补单）', 'POS收款原接口反向交易勾兑（银有我无，客户补单）'),
('0050', 'POS收款反向交易勾兑不成功（银有我无，追回）', 'POS收款反向交易勾兑不成功（银有我无，追回）'),
('0051', 'POS原接口反向交易勾兑不成功（银有我无，确认损失）', 'POS原接口反向交易勾兑不成功（银有我无，确认损失）');
